tiborsimon/embedded-tdd-headers/pic/pic10/pic10f220_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC10F220_H_
#define _PIC10F220_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define GPWUF                         11
#define FSR                           12
#define OSCCAL                        13
#define FOSC4                         14
#define CAL0                          15
#define CAL                           16
#define CAL1                          17
#define CAL2                          18
#define CAL3                          19
#define CAL4                          20
#define CAL5                          21
#define CAL6                          22
#define GPIO                          23
#define GP0                           24
#define GP1                           25
#define GP2                           26
#define GP3                           27
#define ADCON0                        28
#define ADON                          29
#define nDONE                         30
#define GO_nDONE                      31
#define GO                            32
#define CHS0                          33
#define CHS                           34
#define CHS1                          35
#define ANS0                          36
#define ANS                           37
#define ANS1                          38
#define ADRES                         39
#define ADRES0                        40
#define ADRES1                        41
#define ADRES2                        42
#define ADRES3                        43
#define ADRES4                        44
#define ADRES5                        45
#define ADRES6                        46
#define ADRES7                        47

#endif // _PIC10F220_H_
